---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsInMultistoryExceedTopConstraint
source: html/2f85517f-3076-bd03-5e3a-9eb708b77ca9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsInMultistoryExceedTopConstraint Property

Stairs in MultistoryStairs after adjusting still exceed the top constraint.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsInMultistoryExceedTopConstraint { get; }
```